uhnp/src/InformationRegisters/тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений/тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений</name>
  <comment>//Ведутенко С.А. от 18.04.2023 Выполнение задач №000045214</comment>
  <resources>
    <name>НаЧтоЗаменять</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОшибки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЧтоЗаменять</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура УдалитьОшибки(Команда)
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	
	СписокДействий = Новый СписокЗначений;
	СписокДействий.Добавить(КодВозвратаДиалога.Да, "По значению ""Что заменять""");
	СписокДействий.Добавить(КодВозвратаДиалога.Нет, "Все ошибки");
	СписокДействий.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
	
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, "Выберите действие ...", СписокДействий);
	
КонецПроцедуры // УдалитьОшибки()

&НаКлиенте
Процедура ПослеЗакрытияВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана строка с ошибкой.");
			Возврат;
		КонецЕсли;
		
		УдалитьОшибкиНаСервере(ТекДанные.ЧтоЗаменять);
		Элементы.Список.Обновить();
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		УдалитьОшибкиНаСервере();
		Элементы.Список.Обновить();
		
    КонецЕсли;

КонецПроцедуры // ПослеЗакрытияВопроса()

&НаСервере
Процедура УдалитьОшибкиНаСервере(ЧтоЗаменять = Неопределено)
	
	Если ЧтоЗаменять = Неопределено Тогда
		
		НаборЗаписей = РегистрыСведений.тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура("ЧтоЗаменять", ЧтоЗаменять);
	Выборка = РегистрыСведений.тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений.Выбрать(ПараметрыПоиска);
	
	Пока Выборка.Следующий() Цикл
	
		НаборЗаписей = РегистрыСведений.тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЧтоЗаменять.Установить(ЧтоЗаменять);
		НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(Выборка.УникальныйИдентификатор);
		
		НаборЗаписей.Записать();
		
	КонецЦикла;		
	
КонецПроцедуры // УдалитьОшибкиНаСервере()
